NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/variants/mduinorelay/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA
*/

#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

#define NUM_DIGITAL_PINS            70
#define NUM_ANALOG_INPUTS           16
#define analogInputToDigitalPin(p)  ((p < 16) ? (p) + 54 : -1)
#define digitalPinHasPWM(p)         (((p) >= 2 && (p) <= 13) || ((p) >= 44 && (p)<= 46))

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO R inputs
#define PIN_I0_0		(2)
#define PIN_I0_1		(3)
#define PIN_I0_2		(54)
#define PIN_I0_3		(55)
#define PIN_I0_4		(56)
#define PIN_I0_5		(57)
#define PIN_I1_0		(18)
#define PIN_I1_1		(19)
#define PIN_I1_2		(60)
#define PIN_I1_3		(61)
#define PIN_I1_4		(62)
#define PIN_I1_5		(63)
#define PIN_I2_0		(20)
#define PIN_I2_1		(21)
#define PIN_I2_2		(66)
#define PIN_I2_3		(67)
#define PIN_I2_4		(68)
#define PIN_I2_5		(69)

#if defined(MDUINO_57R) || defined(MDUINO_38R) || defined(MDUINO_19R)
static const uint8_t I0_0 = PIN_I0_0;
static const uint8_t I0_1 = PIN_I0_1;
static const uint8_t I0_2 = PIN_I0_2;
static const uint8_t I0_3 = PIN_I0_3;
static const uint8_t I0_4 = PIN_I0_4;
static const uint8_t I0_5 = PIN_I0_5;
#endif
#if defined(MDUINO_57R) || defined(MDUINO_38R)
static const uint8_t I1_0 = PIN_I1_0;
static const uint8_t I1_1 = PIN_I1_1;
static const uint8_t I1_2 = PIN_I1_2;
static const uint8_t I1_3 = PIN_I1_3;
static const uint8_t I1_4 = PIN_I1_4;
static const uint8_t I1_5 = PIN_I1_5;
#endif
#if defined(MDUINO_57R)
static const uint8_t I2_0 = PIN_I2_0;
static const uint8_t I2_1 = PIN_I2_1;
static const uint8_t I2_2 = PIN_I2_2;
static const uint8_t I2_3 = PIN_I2_3;
static const uint8_t I2_4 = PIN_I2_4;
static const uint8_t I2_5 = PIN_I2_5;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO R digital outputs
#define PIN_Q0_0		(4)
#define PIN_Q0_1		(5)
#define PIN_Q0_2		(6)
#define PIN_Q1_0		(8)
#define PIN_Q1_1		(9)
#define PIN_Q1_2		(7)
#define PIN_Q2_0		(12)
#define PIN_Q2_1		(13)

#if defined(MDUINO_57R) || defined(MDUINO_38R) || defined(MDUINO_19R)
static const uint8_t Q0_0 = PIN_Q0_0;
static const uint8_t Q0_1 = PIN_Q0_1;
static const uint8_t Q0_2 = PIN_Q0_2;
#endif
#if defined(MDUINO_57R) || defined(MDUINO_38R)
static const uint8_t Q1_0 = PIN_Q1_0;
static const uint8_t Q1_1 = PIN_Q1_1;
static const uint8_t Q1_2 = PIN_Q1_2;
#endif
#if defined(MDUINO_57R)
static const uint8_t Q2_0 = PIN_Q2_0;
static const uint8_t Q2_1 = PIN_Q2_1;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO R analog outputs
#define PIN_A0_0		(4)
#define PIN_A0_1		(5)
#define PIN_A0_2		(6)
#define PIN_A1_0		(8)
#define PIN_A1_1		(9)
#define PIN_A1_2		(7)
#define PIN_A2_0		(12)
#define PIN_A2_1		(13)

#if defined(MDUINO_57R) || defined(MDUINO_38R) || defined(MDUINO_19R)
static const uint8_t A0_0 = PIN_A0_0;
static const uint8_t A0_1 = PIN_A0_1;
static const uint8_t A0_2 = PIN_A0_2;
#endif
#if defined(MDUINO_57R) || defined(MDUINO_38R)
static const uint8_t A1_0 = PIN_A1_0;
static const uint8_t A1_1 = PIN_A1_1;
static const uint8_t A1_2 = PIN_A1_2;
#endif
#if defined(MDUINO_57R)
static const uint8_t A2_0 = PIN_A2_0;
static const uint8_t A2_1 = PIN_A2_1;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO R relay outputs
#define PIN_R0_1		(23)
#define PIN_R0_2		(22)
#define PIN_R0_3		(25)
#define PIN_R0_4		(24)
#define PIN_R0_5		(40)
#define PIN_R0_6		(39)
#define PIN_R0_7		(38)
#define PIN_R0_8		(37)
#define PIN_R1_1		(28)
#define PIN_R1_2		(27)
#define PIN_R1_3		(30)
#define PIN_R1_4		(29)
#define PIN_R1_5		(45)
#define PIN_R1_6		(44)
#define PIN_R1_7		(43)
#define PIN_R1_8		(42)
#define PIN_R2_1		(33)
#define PIN_R2_2		(32)
#define PIN_R2_3		(35)
#define PIN_R2_4		(34)
#define PIN_R2_6		(49)
#define PIN_R2_7		(48)
#define PIN_R2_8		(47)

#if defined(MDUINO_57R) || defined(MDUINO_38R) || defined(MDUINO_19R)
static const uint8_t R0_1 = PIN_R0_1;
static const uint8_t R0_2 = PIN_R0_2;
static const uint8_t R0_3 = PIN_R0_3;
static const uint8_t R0_4 = PIN_R0_4;
static const uint8_t R0_5 = PIN_R0_5;
static const uint8_t R0_6 = PIN_R0_6;
static const uint8_t R0_7 = PIN_R0_7;
static const uint8_t R0_8 = PIN_R0_8;
#endif
#if defined(MDUINO_57R) || defined(MDUINO_38R)
static const uint8_t R1_1 = PIN_R1_1;
static const uint8_t R1_2 = PIN_R1_2;
static const uint8_t R1_3 = PIN_R1_3;
static const uint8_t R1_4 = PIN_R1_4;
static const uint8_t R1_5 = PIN_R1_5;
static const uint8_t R1_6 = PIN_R1_6;
static const uint8_t R1_7 = PIN_R1_7;
static const uint8_t R1_8 = PIN_R1_8;
#endif
#if defined(MDUINO_57R)
static const uint8_t R2_1 = PIN_R2_1;
static const uint8_t R2_2 = PIN_R2_2;
static const uint8_t R2_3 = PIN_R2_3;
static const uint8_t R2_4 = PIN_R2_4;
static const uint8_t R2_6 = PIN_R2_6;
static const uint8_t R2_7 = PIN_R2_7;
static const uint8_t R2_8 = PIN_R2_8;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO R RS-485
#define HAVE_RS485
#define HAVE_RS485_SOFT
#define RS485_RX				(11)
#define RS485_TX				(10)
#define RS485_RE				(15)
#define RS485_DE				(14)

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO RS-232
#define HAVE_RS232
#define HAVE_RS232_HARD
#define RS232_HWSERIAL 2

#define PIN_SPI_SS    (53)
#define PIN_SPI_MOSI  (51)
#define PIN_SPI_MISO  (50)
#define PIN_SPI_SCK   (52)

